chore: mermaid diagrams [skip ci]
